# ------------------------------------------------------------------------
# zshのキーバインド
# ------------------------------------------------------------------------
# 単語の末尾に移動
bindkey '^F' forward-word
# 前の単語に移動
bindkey '^B' backward-word

# デフォルトキーバインド：https://qiita.com/Rockreeee/items/716df96425d91b91a438

# ------------------------------------------------------------------------
# function()のキーバインド
# ------------------------------------------------------------------------
bindkey '^r' fzf-select-history

bindkey '^t' fzf-cdr

bindkey '^X' zsh_convert_all